<template>
  <div class="m-rank">
    <m-scrollview class="scrollview">
      <m-slider v-bind:arr="arr"></m-slider>
      <p>明确性
        所谓明确就是要用具体的语言清楚地说明要达成的行为标准。明确的目标几乎是所有成功团队的一致特点。很多团队不成功的重要原因之一就因为目标定的模棱两可，或没有将目标有效的传达给相关成员。
        示例：目标——“增强客户意识”。这种对目标的描述就很不明确，因为增强客户意识有许多具体做法，如：减少客户投诉，过去客户投诉率是3%，把它减低到1．5%或者1%。提升服务的速度，使用规范礼貌的用语，采用规范的服务流程，也是客户意识的一个方面。
        有这么多增强客户意识的做法，我们所说的“增强客户意识”到底指哪一块？不明确就没有办法评判、衡量。所以建议这样修改，比方说，我们将在月底前把前台收银的速度提升至正常的标准，这个正常的标准可能是两分钟，也可能是一分钟，或分时段来确定标准。
        实施要求：目标设置要有项目、衡量标准、达成措施、完成期限以及资源要求，使考核人能够很清晰的看到部门或科室月计划要做哪些那些事情，计划完成到什么样的程度。
        衡量性
        衡量性就是指目标应该是明确的，而不是模糊的。应该有一组明确的数据，作为衡量是否达成目标的依据。
        SMART原则
        SMART原则
        如果制定的目标没有办法衡量，就无法判断这个目标是否实现。比如领导有一天问“这个目标离实现大概有多远？”团队成员的回答是“我们早实现了”。这就是领导和下属对团队目标所产生的一种分歧。原因就在于没有给他一个定量的可以衡量的分析数据。但并不是所有的目标可以衡量，有时也会有例外，比如说大方向性质的目标就难以衡量。
        比方说，“为所有的老员工安排进一步的管理培训”。进一步是一个既不明确也不容易衡量的概念，到底指什么？是不是只要安排了这个培训，不管谁讲，也不管效果好坏都叫“进一步”？
        改进一下：准确地说，在什么时间完成对所有老员工关于某个主题的培训，并且在这个课程结束后，学员的评分在85分以上，低于85分就认为效果不理想，高于85分就是所期待的结果。这样目标变得可以衡量。
        实施要求：目标的衡量标准遵循“能量化的质化，不能量化的感化”。使制定人与考核人有一个统一的、标准的、清晰的可度量的标尺，杜绝在目标设置中使用形容词等概念模糊、无法衡量的描述。对于目标的可衡量性应该首先从数量、质量、成本、时间、上级或客户的满意程度五个方面来进行，如果仍不能进行衡量，其次可考虑将目标细化，细化成分目标后再从以上五个方面衡量，如果仍不能衡量，还可以将完成目标的工作进行流程化，通过流程化使目标可衡量。
        可实现性
        目标是要能够被执行人所接受的，如果上司利用一些行政手段，利用权力性的影响力一厢情愿地把自己所制定的目标强压给下属，下属典型的反映是一种心理和行为上的抗拒：我可以接受，但是否完成这个目标，有没有最终的把握，这个可不好说。一旦有一天这个目标真完成不了的时候，下属有一百个理由可以推卸责任：你看我早就说了，这个目标肯定完成不了，但你坚持要压给我。
        “控制式”的领导喜欢自己定目标，然后交给下属去完成，他们不在乎下属的意见和反映，这种做法越来越没有市场。今天员工的知识层次、学历、自己本身的素质，以及他们主张的个性张扬的程度都远远超出从前。因此，领导者应该更多的吸纳下属来参与目标制定的过程，即便是团队整体的目标。
        定目标成长，就先不要想达成的困难，不然热情还没点燃就先被畏惧给打消念头了。
        实施要求：目标设置要坚持员工参与、上下左右沟通，使拟定的工作目标在组织及个人之间达成一致。既要使工作内容饱满，也要具有可达性。可以制定出跳起来“摘桃”的目标，不能制定出跳起来“摘星星”的目标。
        相关性
        目标的相关性是指实现此目标与其他目标的关联情况。如果实现了这个目标，但对其他的目标完全不相关，或者相关度很低，那这个目标即使被达到了，意义也不是很大。</p>
    </m-scrollview>
  </div>
</template>

<script type="text/ecmascript-6">
  import MScrollview from 'base/scrollview/jhscrollview'
  import MSlider from 'base/slider/jhslider'
  export default {
    name: 'm-rank',
    components: {
      MSlider,
      MScrollview
    },
    data() {
      return {
        arr: [
          {
            linkUrl: 'https://y.qq.com/m/act/TNTB/index.html?openinqqmusic=1&ADTAG=jiaodiantu',
            picUrl: 'http://y.gtimg.cn/music/common/upload/MUSIC_FOCUS/983421.jpg',
            id: 18502
          },
          {
            linkUrl: 'https://y.qq.com/m/act/TNTB/index.html?openinqqmusic=1&ADTAG=jiaodiantu',
            picUrl: 'http://y.gtimg.cn/music/common/upload/MUSIC_FOCUS/1045863.jpg',
            id: 18501
          },
          {
            linkUrl: 'https://y.qq.com/m/act/TNTB/index.html?openinqqmusic=1&ADTAG=jiaodiantu',
            picUrl: 'http://y.gtimg.cn/music/common/upload/MUSIC_FOCUS/1043423.jpeg',
            id: 18505
          }
        ]
      }
    }
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="stylus" ref="stylesheet/stylus">
  .m-rank
    width: 100%
    position: fixed
    top: 88px
    bottom: 0
    .scrollview
      width: 100%
      height: 100%
</style>
